Masmiseim36/nxpSDK/boards/mimxrt700evk/edgefast_bluetooth_examples/a2dp_source/cm33_core0/pin_mux.c
/*
 * Copyright 2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */


/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: MIMXRT798S
package_id: MIMXRT798SGFOA
mcu_data: ksdk2_0
processor_version: 0.0.0
pin_labels:
- {pin_num: N5, pin_signal: PIO1_0, label: Debug_TXD, identifier: Debug_TXD}
- {pin_num: N4, pin_signal: PIO0_31, label: Debug_RXD, identifier: Debug_RXD}
- {pin_num: N14, pin_signal: PIO7_23, label: M2_PWREN, identifier: M2_PWREN}
- {pin_num: H7, pin_signal: PIO3_7, label: WL_RST, identifier: WL_RST}
- {pin_num: L17, pin_signal: PIO7_17, label: SDIO_CLK, identifier: SDIO_CLK}
- {pin_num: L16, pin_signal: PIO7_18, label: SDIO_CMD, identifier: SDIO_CMD}
- {pin_num: M17, pin_signal: PIO7_19, label: SDIO_D0, identifier: SDIO_D0}
- {pin_num: M18, pin_signal: PIO7_20, label: SDIO_D1, identifier: SDIO_D1}
- {pin_num: K18, pin_signal: PIO7_21, label: SDIO_D2, identifier: SDIO_D2}
- {pin_num: K17, pin_signal: PIO7_22, label: SDIO_D3, identifier: SDIO_D3}
- {pin_num: R5, pin_signal: PIO1_18, label: BT_UART_RXD, identifier: BT_UART_RXD}
- {pin_num: R4, pin_signal: PIO1_17, label: BT_UART_TXD, identifier: BT_UART_TXD}
- {pin_num: P7, pin_signal: PIO1_19, label: BT_UART_CTS, identifier: BT_UART_CTS}
- {pin_num: P5, pin_signal: PIO1_16, label: BT_UART_RTS, identifier: BT_UART_RTS}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_iopctl.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitDEBUG_UARTPins();
    BOARD_InitPinsM2();
    BOARD_InitM2_SDIOPins();
    BOARD_InitM2_UARTPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: N5, peripheral: LP_FLEXCOMM0, signal: P1, pin_signal: PIO1_0, SelectsTransmitterCurrentDrive: O_100}
  - {pin_num: N4, peripheral: LP_FLEXCOMM0, signal: P0, pin_signal: PIO0_31, SelectsTransmitterCurrentDrive: O_100, InputBufferEnable: enable}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitDEBUG_UARTPins(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t Debug_RXD = (/* Pin is configured as LP_FLEXCOMM0_P0 */
                                IOPCTL_PIO_FUNC1 |
                                /* Disable pull-up / pull-down function */
                                IOPCTL_PIO_PUPD_DI |
                                /* Enable pull-down function */
                                IOPCTL_PIO_PULLDOWN_EN |
                                /* Enables input buffer function */
                                IOPCTL_PIO_INBUF_EN |
                                /* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |
                                /* Input function is not inverted */
                                IOPCTL_PIO_INV_DI |
                                /* Selects transmitter current drive 100ohm */
                                IOPCTL_PIO_DRIVE_100OHM);
    /* PORT0 PIN31 (coords: N4) is configured as LP_FLEXCOMM0_P0 */
    IOPCTL_PinMuxSet(BOARD_INITDEBUG_UARTPINS_Debug_RXD_PORT, BOARD_INITDEBUG_UARTPINS_Debug_RXD_PIN, Debug_RXD);

    const uint32_t Debug_TXD = (/* Pin is configured as LP_FLEXCOMM0_P1 */
                                IOPCTL_PIO_FUNC1 |
                                /* Disable pull-up / pull-down function */
                                IOPCTL_PIO_PUPD_DI |
                                /* Enable pull-down function */
                                IOPCTL_PIO_PULLDOWN_EN |
                                /* Disable input buffer function */
                                IOPCTL_PIO_INBUF_DI |
                                /* Pseudo Output Drain is disabled */
                                IOPCTL_PIO_PSEDRAIN_DI |
                                /* Input function is not inverted */
                                IOPCTL_PIO_INV_DI |
                                /* Selects transmitter current drive 100ohm */
                                IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN0 (coords: N5) is configured as LP_FLEXCOMM0_P1 */
    IOPCTL_PinMuxSet(BOARD_INITDEBUG_UARTPINS_Debug_TXD_PORT, BOARD_INITDEBUG_UARTPINS_Debug_TXD_PIN, Debug_TXD);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPinsM2:
- options: {callFromInitBoot: 'true', coreID: cm33_core0, enableClock: 'true'}
- pin_list:
  - {pin_num: H7, peripheral: GPIO3, signal: 'IO, 7', pin_signal: PIO3_7, direction: OUTPUT, gpio_direction: out, gpio_init_state: 'false'}
  - {pin_num: N14, peripheral: GPIO7, signal: 'IO, 23', pin_signal: PIO7_23, direction: OUTPUT, gpio_direction: out, gpio_init_state: 'false'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

