Masmiseim36/nxpSDK/boards/mimxrt700evk/edgefast_bluetooth_examples/a2dp_source/cm33_core0/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitM2_UARTPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 (Core #0) */
void BOARD_InitM2_UARTPins(void)
{
    /* Reset IOPCTL0 module */
    RESET_ClearPeripheralReset(kIOPCTL0_RST_SHIFT_RSTn);

    const uint32_t BT_UART_RTS = (/* Pin is configured as LP_FLEXCOMM3_P2 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN16 (coords: P5) is configured as LP_FLEXCOMM3_P2 */
    IOPCTL_PinMuxSet(BOARD_INITM2_UARTPINS_BT_UART_RTS_PORT, BOARD_INITM2_UARTPINS_BT_UART_RTS_PIN, BT_UART_RTS);

    const uint32_t BT_UART_TXD = (/* Pin is configured as LP_FLEXCOMM3_P1 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Disable input buffer function */
                                  IOPCTL_PIO_INBUF_DI |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN17 (coords: R4) is configured as LP_FLEXCOMM3_P1 */
    IOPCTL_PinMuxSet(BOARD_INITM2_UARTPINS_BT_UART_TXD_PORT, BOARD_INITM2_UARTPINS_BT_UART_TXD_PIN, BT_UART_TXD);

    const uint32_t BT_UART_RXD = (/* Pin is configured as LP_FLEXCOMM3_P0 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN18 (coords: R5) is configured as LP_FLEXCOMM3_P0 */
    IOPCTL_PinMuxSet(BOARD_INITM2_UARTPINS_BT_UART_RXD_PORT, BOARD_INITM2_UARTPINS_BT_UART_RXD_PIN, BT_UART_RXD);

    const uint32_t BT_UART_CTS = (/* Pin is configured as LP_FLEXCOMM3_P3 */
                                  IOPCTL_PIO_FUNC1 |
                                  /* Disable pull-up / pull-down function */
                                  IOPCTL_PIO_PUPD_DI |
                                  /* Enable pull-down function */
                                  IOPCTL_PIO_PULLDOWN_EN |
                                  /* Enables input buffer function */
                                  IOPCTL_PIO_INBUF_EN |
                                  /* Pseudo Output Drain is disabled */
                                  IOPCTL_PIO_PSEDRAIN_DI |
                                  /* Input function is not inverted */
                                  IOPCTL_PIO_INV_DI |
                                  /* Selects transmitter current drive 100ohm */
                                  IOPCTL_PIO_DRIVE_100OHM);
    /* PORT1 PIN19 (coords: P7) is configured as LP_FLEXCOMM3_P3 */
    IOPCTL_PinMuxSet(BOARD_INITM2_UARTPINS_BT_UART_CTS_PORT, BOARD_INITM2_UARTPINS_BT_UART_CTS_PIN, BT_UART_CTS);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
